Repository: dever-pl/tind
Catalog: po/R-*.po
Languages: pl

source: invalid %s argument
pl: niepoprawny argument %s

source: character string expected
pl: oczekiwano łańcucha znakowego

source: operating system did not accept locale %s
pl: system operacyjny nie zaakceptował określenia lokalizacji %s

source: Hint: on majority of modern operating systems locale is of the form %s (%s for language, %s for country) optionally followed by a dot and a character set identifier, for example, %s
pl: Wskazówka: na większości współczesnych systemów operacyjnych określenie lokalizacji przyjmuje postać %s (%s dla języka, %s dla kraju) z opcjonalną informacją o stronie kodowej po kropce, np. %s

source: locale information not available
pl: informacja o lokalizacji niedostępna

source: using default settings
pl: przyjęto ustawienia domyślne

source: NAs introduced
pl: pojawiły się wartości NA

source: first position %s: %s
pl: pierwsza pozycja %s: %s

source: type: %s
pl: typ: %s

source: seconds since the Epoch
pl: czasu unixowy (sekundy od 1970-01-01 00:00:00Z)

source: seconds since midnight
pl: sekundy od północy

source: representation: %s
pl: reprezentacja: %s

source: time zone: %s
pl: strefa czasowa: %s

source: consider providing %s or %s argument
pl: rozważ podanie argumentu %s lub %s

source: order: %s
pl: kolejność: %s

source: invalid multiplier for time unit %s
pl: nieprawidłowy mnożnik dla jednostki czasu %s

source: admissible values: %s
pl: akceptowane wartości: %s

source: invalid date (%s) for time zone %s
pl: nieprawidłowa data (%s) dla strefy czasowej %s

source: results for dates before %s might be incorrect
pl: wyniki dla dat przed %s mogą być nieprawidłowe

source: ambiguous date-time indices
pl: niejednoznaczna data i godzina

source: first occurrence: %s
pl: pierwsze wystąpienie: %s

source: assuming: %s
pl: przyjęto: %s

source: not %s
pl: nie %s

source: year
pl: rok

source: quarter
pl: kwartał

source: month
pl: miesiąc

source: week
pl: tydzień

source: date
pl: data

source: date-time
pl: data i godzina

source: time of day
pl: godzina

source: integer index
pl: indeks całkowitoliczbowy

source: numeric index
pl: indeks liczbowy

source: time zone provided for type other than %s
pl: podano strefę czasowa dla typu innego niż %s

source: invalid time index type in %s: %s
pl: nieprawidłowy typ indeksu czasowego w %s: %s

source: invalid time index type: %s
pl: nieprawidłowy typ indeksu czasowego: %s

source: expected: %s
pl: oczekiwano: %s

source: expected one of the following: %s
pl: oczekiwano jednego z: %s

source: day
pl: dzień

source: day of year
pl: dzień roku

source: day of week
pl: dzień tygodnia

source: hour
pl: godzina

source: minute
pl: minuta

source: second
pl: sekunda

source: hour, 12-hour clock
pl: godzina, zegar 12-godzinny

source: AM/PM indicator
pl: wskaźnik przedpołudnie / popołudnie

source: time zone / UTC offset
pl: strefa czasowa / przesunięcie względem UTC

source: unrecognised / unsupported time index components: %s
pl: nierozpoznane / niewspierane składowe indeksu czasowego: %s

source: unrecognised time index components: %s
pl: nierozpoznane składowe indeksu czasowego: %s

source: Hint: recognised components are: %s
pl: Wskazówka: rozpoznawane składowe to: %s

source: cannot infer type / construct time index based on the following components: %s
pl: nie można wywnioskować typu / skonstruować indeksu czasowego na podstawie składowych: %s

source: cast from time index type %s to type %s in %s not possible
pl: konwersja typu %s do typu %s w %s nie jest możliwa

source: time units not supported with type %s
pl: jednostki czasu nie są wspierane dla typu %s

source: invalid time unit for type %s
pl: nieprawidłowa jednostka czasu dla typu %s

source: admissible units: %s
pl: akceptowane jednostki: %s

source: time unit provided for type %s
pl: podano jednostkę czasu dla typu %s

source: positive integer expected for type %s
pl: oczekiwano dodatniej liczby całkowitej dla typu %s

source: positive number expected for type %s
pl: oczekiwano dodatniej liczby dla typu %s

source: time zone %s currently not supported by %s
pl: strefa czasowa %s nie jest obecnie obsługiwana przez %s

source: assuming %s refers to time zone %s
pl: przyjęto, że %s odnosi się do strefy czasowej %s

source: ambiguous time zone name: %s
pl: niejednoznaczna nazwa strefy czasowej: %s

source: possible matches: %s
pl: możliwe dopasowania: %s

source: unrecognised time zone: %s
pl: nierozpoznana strefa czasowa: %s

source: you can find the list of time zones by running %s
pl: listę obsługiwanych stref czasowych uzyskasz uruchamiając %s

source: different time zones of arguments
pl: różne strefy czasowe argumentów

source: ambiguous abbreviation %s for time zone %s
pl: niejednoznaczny skrót %s dla strefy czasowej %s

source: results for earlier dates may be incorrect
pl: wyniki dla wcześniejszych dat mogą być nieprawidłowe

source: unrecognised abbreviations for time zone %s: %s
pl: nierozpoznane skróty dla strefy czasowej %s: %s

source: recognised abbreviations: %s
pl: rozpoznawane skróty: %s

source: time zone abbreviations and/or UTC offsets not available
pl: skróty stref czasowych i/lub przesunięcia względem UTC nie są dostępne

source: using default values
pl: przyjęto wartości domyślne

source: ambiguous abbreviations: %s
pl: niejednoznaczne skróty: %s

source: provide %s argument
pl: podaj argument %s

source: consider providing %s argument
pl: rozważ podanie argumentu %s

source: TRUE/FALSE expected
pl: oczekiwano wartości TRUE/FALSE

source: longer object length is not a multiple of shorter object length
pl: długość dłuższego obiektu nie jest wielokrotnością długości krótszego obiektu

source: %s argument missing
pl: nie podano argumentu %s

source: expected an integer vector
pl: oczekiwano wektora całkowitoliczbowego

source: single non-NA date expected
pl: oczekiwano pojedynczej daty niebędącej NA

source: single non-NA integer expected
pl: oczekiwano pojedynczej liczby całkowitej niebędącej NA

source: AM/PM indicators not available in the selected / current locale
pl: wskaźniki przedpołudnie / popołudnie nie są dostępne w wybranej / systemowej lokalizacji

source: %s or %s argument provided without %s
pl: podano %s lub %s bez %s

source: %s argument provided without %s
pl: podano argument %s bez %s

source: %s or %s argument provided with nonnumeric %s
pl: podano argument %s lub %s z %s niebędącym liczbą

source: expected a numeric vector
pl: oczekiwano wektora liczbowego

source: type not provided
pl: nie podano typu

source: expected a sequence of consecutive dates
pl: oczekiwano ciągu następujących po sobie dat

source: expected a function
pl: oczekiwano funkcji

source: error while evaluating function given as %s: %s
pl: błąd podczas wywołania funkcji podanej jako %s: %s

source: invalid return from function given as %s
pl: nieprawidłowa wartość zwrócona przez funkcję podaną jako %s

source: %s is not recognised as a class representing time indices
pl: nie rozpoznano %s jako klasy reprezentującej indeksy czasowe

source: %s method not defined for class %s
pl: metoda %s nie jest zdefiniowana dla klasy %s

source: time index type could not be automatically inferred
pl: nie można automatycznie wywnioskować typu

source: NAs introduced by coercion
pl: pojawiły się wartości NA przy konwersji

source: %s provided together with %s
pl: podano %s wraz z %s

source: %s or %s provided for type %s
pl: podano %s lub %s dla typu %s

source: provide %s, %s, or %s argument
pl: podaj argument %s, %s lub %s

source: trying to convert a data frame with no columns to %s
pl: próba konwersji tabeli bez kolumn do %s

source: TRUE/FALSE/NA expected
pl: oczekiwano wartości TRUE/FALSE/NA

source: time index type mismatch in %s with %s set to %s
pl: niezgodność typów indeksów w %s przy %s ustalonym na %s

source: ordered, non-duplicated indices without NAs expected
pl: oczekiwano posortowanych, niepowtarzających się indeksów bez wartości NA

source: %s cannot be set to %s if %s is not of %s class
pl: %s nie może być %s, jeśli %s nie jest klasy %s

source: format specification for type %s is not supported
pl: specyfikacja formatu dla typu %s nie jest wspierana

source: use %s or %s
pl: użyj %s lub %s

source: a letter or %s expected after %s
pl: oczekiwano litery lub %s po %s

source: unrecognised / unsupported format specifiers: %s
pl: nierozpoznane / niewspierane specyfikacje formatu: %s

source: Note: week and weekday specifiers not compliant with ISO 8601 (%s) are not supported
pl: Wskazówka: specyfikacje tygodnia i dnia tygodnia niezgodne z ISO 8601 (%s) nie są wspierane

source: use %s and %s
pl: użyj %s i %s

source: Note: nonstandard / locale dependent specifiers (%s) are not supported
pl: Wskazówka: niestandardowe / zależne od lokalizacji specyfikacje (%s) nie są wspierane

source: the following specifiers are not supported for type %s: %s
pl: następujące specyfikacje nie są wspierane dla typu %s: %s

source: admissible specifiers: %s
pl: akceptowane specyfikacje: %s

source: Hint: use %s and %s (week-based year) specifiers instead of %s and %s for type %s
pl: Wskazówka: użyj specyfikacji %s i %s (rok indeksu tygodniowego) zamiast %s i %s dla typu %s

source: UTC offset not available
pl: przesunięcie względem UTC nie jest dostępne

source: time zone abbreviation not available
pl: skrót strefy czasowej nie jest dostępny

source: format specifier %s (or %s) used for years outside %d-%d range
pl: specyfikacja formatu %s (lub %s) zastosowana dla lat spoza przedziału %d-%d

source: character string or character vector expected
pl: oczekiwano łańcucha znakowego lub wektora łańcuchów

source: no valid format specification
pl: brak prawidłowych specyfikacji formatu

source: ignoring invalid format specifications: %s
pl: następujące nieprawidłowe specyfikacje formatu zostały zignorowane: %s

source: conflicting types inferred: %s
pl: wywnioskowano sprzeczne typy: %s

source: type inferred (%s) is different from type provided as argument (%s)
pl: typ wywnioskowany (%s) różny od typu podanego jako argument (%s)

source: the following components will be ignored: %s
pl: następujące składowe zostaną zignorowane: %s

source: type inferred: %s
pl: typ wywnioskowany: %s

source: time index type mismatch in %s
pl: niezgodność typów indeksów w %s

source: %s or %s provided with more than two vectors of time indices
pl: podano %s lub %s z więcej niż dwoma wektorami indeksów czasowych

source: ordered time indices expected with more than two vectors of time indices
pl: oczekiwano uporzadkowanych indeksów z więcej niż dwoma wektorami indeksów czasowych

source: unary operator %s not defined for %s objects
pl: unarny operator %s nie jest zdefiniowany dla obiektów klasy %s

source: operator %s not defined for %s and %s objects
pl: operator %s nie jest zdefiniowany dla obiektów klas %s i %s

source: time unit mismatch in %s
pl: niezgodność jednostek czasu w %s

source: invalid arguments of %s operator
pl: nieprawidłowe argumenty operatora %s

source: positive integer expected
pl: oczekiwano dodatniej liczby całkowitej

source: ordered time indices expected
pl: oczekiwano uporządkowanych indeksów czasowych

source: resolution cannot be determined
pl: nie można określić rozdzielczości

source: failed to construct regularly spaced time indices
pl: nie udało się utworzyć regularnych indeksów czasowych

source: argument of length 0
pl: argument długości 0

source: original time indices are not regular
pl: wyjściowe indeksy czasowe nie są regularne

source: failed to regularly extend time indices
pl: nie udało się utworzyć regularnego przedłużenia indeksów czasowych

source: failed to map %s %s to a time zone
pl: nie udało się przypisać %s %s do strefy czasowej

source: invalid value of option %s
pl: nieprawidłowa wartość opcji %s

source: invalid time axis limits
pl: nieprawidłowe ograniczenia osi czasu

source: expected %s of length 1 or %s of length 2
pl: oczekiwano %s długości 1 lub %s długości 2

source: empty time time interval
pl: pusty przedział czasowy

source: limits of type %s cannot be used with indices of type %
pl: granice typu %s nie mogą być uzyte z indeksami typu %

source: no data within time interval
pl: brak danych w przediale czasowym

source: %s and %s are of different lengths
pl: %s i %s są różnej długości

source: nonnegative integer expected
pl: oczekiwano nieujemnej liczby całkowitej

source: %s greater than %s
pl: %s większe od %s

source: time difference
pl: różnica czasu

source: unit
pl: jednostka

source: time interval
pl: przedział czasowy

source: time interval (time of day)
pl: przedział czasowy (pora dnia)

source: time interval in years
pl: przedział czasowy w latach

source: time interval in quarters
pl: przedział czasowy w kwartałach

source: time interval in months
pl: przedział czasowy w miesiącach

source: time interval in weeks
pl: przedział czasowy w tygodniach

source: time interval in days
pl: przedział czasowy w dniach

source: integer interval
pl: przedział liczb całkowitych

source: numeric interval
pl: przedział liczbowy

source: empty
pl: pusty

source: length 0
pl: długość 0

source: reached %s -- omitted %d entries
pl: osiągnięto %s -- pominięto %d pozycji

source: %s function not defined for type %s
pl: funkcja %s nie jest zdefiniowana dla typu %s

source: use %s function instead
pl: użyj funkcji %s

source: %s and %s arguments missing
pl: nie podano argumentów %s i %s

source: single non-NA index expected
pl: oczekiwano pojedynczego indeksu niebędącego NA

source: %s, %s, and %s arguments provided
pl: podano argumenty %s, %s i %s

source: non-negative integer expected
pl: oczekiwano nieujemnej liczby całkowitej

source: %s argument equals 0
pl: argument %s równy 0

source: wrong sign in %s argument
pl: niepoprawny znak argumentu %s

source: invalid arguments of %s
pl: nieprawidłowe argumenty %s

source: expected two objects of %s or %s class
pl: oczekiwano dwóch obiektów klasy %s lub %s

source: expected an object of %s or %s class
pl: oczekiwano obiektu klasy %s lub %s

source: integer value expected
pl: oczekiwano liczby całkowitej

source: single non-NA value expected
pl: oczekiwano pojedynczej wartości niebędącej NA

source: parse error / could not recognise format in %s
pl: błąd przetwarzania / nie można rozpoznać formatu w %s

source: cannot determine result type in %s
pl: nie można określić typu wyniku w %s

source: %s provided with time index components (%s) in %s constructor
pl: %s podane wraz ze składowymi indeksu (%s) w konstruktorze %s

source: unnamed arguments in %s constructor
pl: nienazwane argumenty w konstruktorze %s

source: duplicated time index components: %s
pl: powtórzone składowe indeksu czasowego: %s

source: %s and %s arguments missing or NULL
pl: nie podano argumentów %s i %s lub podano wartości NULL

source: different lengths of arguments: %d, %d
pl: różne długości argumentów: %d, %d

source: nonempty character string expected
pl: oczekiwano niepustego łańcucha znakowego

source: expected a 2-element list
pl: oczekiwano dwuelementowej listy

source: expected a 2-column data frame
pl: oczekiwano dwukolumnowej tabeli danych

source: partial match of %s to %s
pl: częściowe dopasowanie %s do %s

source: replacement is of length %d, number of intervals is %d
pl: zastępstwo długości %d, liczba przedziałów to %d

source: expected all arguments to be of %s class in %s
pl: oczekiwano wszystkich argumentów klasy %s w %s

source: %s is not recognised as a class representing time differences
pl: nie rozpoznano %s jako klasy reprezentującej różnice czasu

source: starting times adjusted
pl: dostosowano początki przedziałów

source: end times adjusted
pl: dostosowano końce przedziałów
